#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ t
Ġ a
Ġt h
i n
e r
o u
o n
Ġ s
Ġ i
Ġth e
r e
a t
Ġ w
Ġ c
o r
e s
in g
a n
e n
Ġ b
Ġ f
Ġt o
Ġ d
l e
Ġ m
Ġ I
Ġ y
e d
Ġy ou
Ġ p
Ġa n
s t
Ġ h
l l
Ġ in
i t
Ġ n
i on
Ġ o
Ġi t
Ġi s
o m
s e
c t
a r
Ġ u
o t
Ġ l
e t
o w
i s
Ġ re
u t
v e
Ġan d
Ġ e
i c
Ġth at
a s
Ġo f
a l
r o
en t
Ġw h
Ġb e
d e
Ġf or
Ġ g
l d
T h
Ġ on
Ġ `
Ġ Ġ
l y
a m
a y
v er
Ġd o
a c
Ġn ot
. .
a d
it h
ou ld
es t
Ġth is
' t
q u
b le
i d
Ġh a
Ġs t
er e
a ll
k e
Ġw ith
r i
Ġp ro
Ġa s
Ġyou r
t h
c e
k s
at e
Ġha ve
Ġb ut
Ġe x
o o
h t
Ġ Th
e c
Ġc o
' s
a g
Ġc an
ou t
i m
p p
Ġu s
Ġ (
c h
i ll
at ion
Ġw or
Ġn e
Ġf i
Ġc on
t er
Ġ A
u n
Ġ j
Ġs e
Ġs o
Ġa re
Ġ v
u st
m ent
Ġ S
Ġm y
i g
e ct
p t
e m
Ġs h
Ġi f
Ġs u
Ġl i
Ġ qu
n d
p le
u l
Ġc h
es s
Ġc om
Ġ or
an t
o re
all y
i f
Ġ "
am e
Ġp o
Ġco de
p l
est ion
ĠĠ ĠĠ
Ġu se
an d
i l
t p
u r
Ġwh at
Ġs om
c om
Ġm e
r y
/ /
an ks
s w
Ġ r
Ġa l
a se
: //
r om
e l
Ġwor k
a in
Ġ C
Ġw ill
ct ion
ac k
Ġj ust
sw er
s o
Ġd e
l o
ag e
et h
Ġ -
Ġan swer
o d
a ble
Ġw ould
u e
Ġg et
Ġne ed
in k
.. .
u m
Y ou
Ġw as
Ġdo es
an g
Ġd on
Ġa t
Ġa d
Ġf rom
Ġ W
a b
Ġa ll
in d
Ġli ke
f er
i e
Ġan y
Ġqu estion
s s
Ġw ant
er s
Ġm a
en d
Ġa b
Ġth ere
Ġus ing
as s
Ġc l
n t
Ġ k
e x
Ġa pp
in e
Ġsh ould
u s
ic h
j ect
a v
) .
Ġl oo
Ġu p
or t
Ġsom e
Ġad d
ble m
Ġw e
Ġ :
Ġi m
ar t
Ġ B
a ct
Ġon e
Ġ P
Ġpro blem
Ġb y
p er
p e
Ġ out
ou g
Ġ M
Ġ D
Ġh ow
Ġh t
' m
ul t
i st
Ġ O
Ġwh en
n ow
Ġd at
Ġthe n
at ed
in t
Ġl o
ac h
i ve
i re
Ġon ly
( )
Ġv al
Ġk now
r or
it e
Ġwh ich
t o
Ġt ry
Ġ 1
u re
Ġht tp
im e
Ġm ore
r ing
u se
Ġth ink
a re
Ġw ay
Ġcon t
Ġ H
ver y
ĠTh e
ĠI t
Ġse e
i z
el p
Ġn o
un ction
a st
0 0
Ġw r
i de
Ġab out
k ing
Ġa r
a p
i v
er ror
ie w
th er
oug h
Ġs ame
i r
or m
Ġin st
Ġh elp
Ġ le
a use
h at
Ġa m
ou nd
Ġd id
ou r
i le
Ġso l
Ġ =
Ġ You
Ġ *
Ġfi le
l ow
Ġ error
ex t
Ġ J
Ġh as
ht tp
Ġ N
ig ht
Ġ [
ot h
Ġf unction
e ad
Ġs et
Ġ F
b ject
Ġre s
Ġc ould
re ad
c ri
Ġch ang
eth od
ow s
Ġs p
ic e
Ġ '
Ġa c
ac e
o de
Ġo ther
it y
ĠI f
on g
am ple
c l
t ing
c ess
ri g
ar d
Ġpo st
er y
ec k
Ġp re
Ġ 2
Ġth an
Ġm ethod
Ġ T
Ġcom p
Ġd if
g r
pt ion
Ġdat a
Ġe v
l es
ut ion
Ġ U
Ġu n
e ll
Ġcl ass
ur n
a il
Ġal so
ar i
ĠĠĠĠ ĠĠĠĠ
Ġs er
o c
Ġt ime
Ġ E
p o
u ally
s ion
Ġc all
m l
Th anks
Ġdoes n
' re
i al
Ġt r
Ġc re
on t
Ġg o
Ġr un
nd er
rig ht
ic k
f orm
Ġdif fer
Ġbe c
en ce
o ver
Ġ R
Ġme an
Ġma ke
eth ing
ar y
Ġne w
Ġbec ause
le ase
Ġa ct
y pe
g g
p ut
cri pt
o l
Ġp l
' ve
f low
Ġre t
Ġst ill
or re
Ġn ow
oo d
o ve
] (
r ay
ĠTh anks
at h
Ġb et
Ġ en
Ġs im
on e
Ġsu re
` .
Ġt ri
Ġ right
Ġsol ution
Ġwor ks
Ġp er
Ġsom ething
Ġex ample
Ġ G
t e
i ble
Ġfi r
ic ation
f f
Ġfir st
or y
Ġthe y
l i
Ġde f
Ġ: )
o st
Ġo bject
orre ct
Ġin to
Ġwh y
w w
b er
Ġthe m
Ġu nder
on d
Ġ L
or d
Ġre ad
Ġm ay
u ch
em s
over flow
Ġch eck
ĠB ut
w ay
Ġh ere
ack overflow
an k
Ġret urn
Ġm an
ig n
u ll
Ġtri ed
Ġth ing
Ġval ue
ow n
r u
Ġwh ere
Ġa g
' ll
st ackoverflow
f ter
i es
Ġs ay
a ve
Ġre ally
s er
Ġm uch
ment s
Ġpo int
Ġc ase
f ore
Ġup d
b e
an ce
Ġre qu
Ġloo k
Ġ very
Ġd is
Ġ ?
Ġ ke
u g
en er
Ġ .
e p
w h
I t
i p
Ġc orrect
Ġsp ec
ed it
Ġus ed
Th e
Ġdiffer ent
estion s
Ġst ring
ou s
Ġ ver
it ion
Ġfor m
t y
le d
iz e
Ġp art
) ;
Ġus er
Ġs c
a ke
g et
ĠI n
av a
Ġis s
le ct
Ġin ter
u b
Ġre m
Ġit s
p re
Ġo ver
Ġf ind
Ġt est
Ġp age
oth er
Ġg ood
st and
Ġwork ing
c k
Ġ edit
Ġli st
th ing
I n
Ġv ari
u es
s h
qu estions
r a
p h
Ġco l
Ġa fter
Ġs y
ire ct
Ġp ar
at ch
Ġchang e
Ġser ver
b r
Ġl ine
Ġm ight
Ġl ink
ss ible
n ot
Ġto o
Ġth anks
n ing
Ġ 3
Ġtry ing
Ġe very
Ġbe fore
Ġinst ead
u al
Ġar ray
at ing
ĠTh is
Ġg u
Ġt ype
Ġres ult
Ġt w
Y es
l f
i ld
` ,
Ġex pl
Ġunder stand
S t
Ġh e
re e
Th is
) ,
Ġb ack
ic ally
u d
Ġpro per
ce pt
Ġspec if
Ġn um
Ġev en
Ġsh ow
l ication
gr am
p ro
Ġ $
u ment
Ġwe ll
Ġcom m
Ġbet ter
o se
p en
in ce
w e
ro ll
Ġs ec
o x
Ġver sion
e w
or ry
Ġp ut
Ġact ually
ĠS o
a k
ĠA nd
ple ment
W hat
Ġdid n
Ġsu gg
read y
ĠTh at
Ġ <
s p
Ġiss ue
Ġe ach
Ġex act
Ġd es
Ġg ener
Ġsu pp
ab ly
Ġ V
i ent
Ġcon f
Ġh ad
Ġp r
Ġse ems
Ġe le
Ġt able
Ġre fer
ĠW h
v ice
f t
e ver
ht ml
ru ct
t on
u p
Ġv iew
ar ch
our ce
Ġan other
Ġst art
ag es
Ġ @
Ġb r
s ide
at a
Ġim plement
Ġth r
Ġc le
ot e
Ġf o
ĠW hat
Ġth ough
Ġn ame
Ġag ain
ou nt
p ort
d u
b ut
Ġt ext
Ġwith out
Ġi de
Ġal ready
* *
v ing
a x
n et
p y
v ed
Ġdo ing
Ġcre ate
f ul
Ġb u
Ġtw o
id d
W h
se lf
M L
Ġpro v
Ġwr ong
s ing
= "
' d
Ġpro gram
0 1
l so
Ġh and
or g
a pp
Ġd own
b ably
Ġb it
ĠH ow
Ġs a
as on
Ġl ot
Ġp lease
ur re
Ġbe ing
it t
o s
Ġpo ssible
Ġlo g
se t
de x
at or
Ġg ive
en c
Ġg ot
Ġas s
v al
Ġd ec
Ġapp lication
Ġ ent
Ġab ove
oo k
ce ption
Ġdef in
Ġha pp
Ġ 0
st em
Ġsu b
Ġfi les
c on
al led
Q L
Ġis n
Ġke y
way s
Ġ end
Ġwe b
ab ase
th e
Ġm od
Ġre g
Ġadd ed
Ġb oth
Ġd irect
Ġs ince
Ġe as
Ġqu ery
) `
" ,
at es
Ġfi x
Ġbe en
Ġm em
Ġre ason
Ġsec ond
Ġdo c
Ġlo ad
Ġac cess
p ect
a ult
Ġe l
a h
i se
t r
() `
e ar
Ġin cl
Ġget ting
Ġgo ing
e e
Ġcom ment
an s
Ġexact ly
V iew
Ġpro ject
Ġ X
Ġpro bably
Ġre c
Ġp ass
d er
p ly
I f
um n
as h
Ġch ar
pl ay
is h
Ġa ble
Ġm is
Ġst ate
Ġ 4
Ġg iv
Ġval ues
ation s
or k
ww w
h ow
Ġm ess
urre nt
n ect
Ġlo c
Ġat t
q l
Ġe m
ent ion
lo ad
Ġi d
ĠS t
j s
Ġrequ ire
Ġide a
ph p
i a
Ġg r
br ary
" .
Ġhapp en
Ġloo king
in al
w n
Ġd et
pl ic
Ġcom ple
ter n
lo g
Ġcon st
Ġnum ber
Ġth ose
Ġcont ain
p ar
p on
Q u
Ġf ine
Ġwr ite
Ġb as
Ġdat abase
if y
Ġgu ess
ode l
Ġvari able
us er
Ġev ent
Ġa ut
Ġ x
Ġim age
re at
o p
ĠI s
ro l
Ġth read
Ġs cript
er t
o b
Ġany thing
ar k
Ġ +
Ġa v
Th at
Ġse lect
ve lo
Ġal ways
ĠD o
Ġ {
Ġf ound
p end
th is
m y
Ġcle ar
ab les
Ġloo p
ang e
Ġout put
Ġo ption
C ont
Ġin t
i ous
ail s
ith er
we en
re ss
Ġwh o
Ġ /
idd le
n ame
ro id
Ġex t
o g
e ld
Ġpar am
id er
Ġpro cess
am es
Ġo wn
oug ht
Th ank
r ame
Ġthe se
Ġapp ro
at ive
ĠA lso
Ġ* *
g e
Ġfi eld
Ġdon e
Ġthr ough
o pe
u de
v en
Ġcol umn
i ed
+ +
om e
Ġbut ton
in ter
l ess
v iew
Ġt ag
y n
Ġman y
ĠA n
Ġbr ows
ĠM y
Ġupd ate
i x
Ġsu ch
oo g
Ġt ake
Ġl ong
Ġ ...
Ġsupp ort
Ġrequ est
Ġthing s
Ġm ult
Ġ _
Ġsugg est
d oc
Ġac cept
Ġc lo
Ġf e
Ġt y
roll er
ind ows
Ġex ec
Ġ 5
m s
Ġcon s
Ġl in
Ġo pen
Ġel se
Ġupd ated
E x
i k
i b
Ġwork ed
C h
ul ar
Ġas k
Ġre l
f or
Ġp h
Ġloo ks
1 0
E R
( "
Ġin side
c re
Ġm ost
f o
Ġc alled
Ġne ver
Ġin put
ut e
Ġt ell
Ġexpl ain
th on
Ġin form
Ġ ,
Ġst ore
Ġth ought
Ġex ist
ust om
pre ss
g er
Ġex pect
Ġsa id
Ġparam et
Ġval id
et c
k es
oog le
Ġsim ple
ĠTh ere
Ġrun ning
ĠH T
1 2
Ġre al
Ġbet ween
Ġm ention
ĠJ ava
Ġor ig
Ġdis play
ing le
Ġde pend
v ent
Ġmem ory
Ġm ain
i er
Ġdoc ument
c ode
w ork
O N
at ic
im es
Ġcomp il
qu ery
( '
Ġw ere
ri but
o id
Ġcont ent
Ġc urrent
d d
Ġle t
h ing
Ġw on
oo l
ath er
Ġde le
Qu ery
Ġcon nect
Ġwh ile
I s
Ġ- -
c ont
Ġm ust
en se
Ġbe h
Ġspecif ic
ll ow
Ġinform ation
Ġha ving
E T
N o
Ġres pon
ĠTh ank
Ġl ast
wh ere
x t
ate ly
Ġof f
Ġ }
D o
Ġor der
ang u
Ġcomm and
ap s
C an
Ġmult i
Ġele ment
ie ve
: :
Ġex ception
Ġe ff
Ġma kes
Ġy es
S T
ld er
Ġs ingle
v ious
m in
Ġdef ault
av as
Ġper form
so l
Ġ etc
I N
c es
c i
Ġform at
eth er
Ġ ;
ĠC h
avas cript
Ġcl ient
Ġs ource
Ġe ither
Ġo per
ĠC an
! !
e o
Ġs end
Ġse arch
Ġcan not
lo ck
Ġchar act
Ġrefer ence
c c
f ile
1 1
Ġh ead
e b
Ġb est
Ġke ep
.. ..
Ġin it
Ġcl ick
s ql
i o
pl o
R e
Ġbu ild
Ġnot hing
ĠA s
Ġthe ir
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
ic al
ĠS QL
ind ow
` ?
are d
d o
H P
ĠF or
Ġac c
are nt
Ġty p
Ġg reat
Ġcont rol
Ġcon ver
ĠJ S
le ction
Ġr ather
S S
Ġm atch
Ġfo llow
â Ģ
b u
p r
Ġin dex
Ġass um
it ing
Ġmean s
Ġh ard
Ġmess age
Ġset ting
Ġk ind
Ġorig inal
Ġs ize
Ġp ath
Ġ` $
it s
L ist
H ow
Ġbrows er
Ġs m
Ġar g
ĠO P
Ġl angu
e ah
de f
t ed
w hat
Ġse em
Ġco py
Ġma de
il ity
y ou
us ing
p x
Ġproper ty
ec h
P ro
t ime
st r
Ġo b
n o
Ġprov ide
Ġm at
ĠO n
Ġsy stem
itt le
St ring
com m
Ġen ough
iz ed
l ine
Ġst and
6 4
po s
u le
Ġl at
Ġcomple te
Ġar ound
ess ion
' ,
il ar
Ġappro ach
Ġs ort
Ġre pl
Ġrem ove
Ġpl ace
Ġinst ance
Ġs ense
Ġchang ed
ach e
ou p
Ġd u
Ġtr ue
Ġon ce
eo ple
ay be
- -
w are
t ty
at ure
Ġt em
R L
Ġl ittle
Ġrespon se
m m
o f
Ġb ad
Ġli brary
Ġfi g
y thon
Ġmay be
Ġf act
Ġle ast
m an
Ġpr int
A nd
Ġmulti ple
ĠP HP
ĠHT ML
s ent
Ġc ustom
ĠO r
Ġm odel
Ġconf ig
b ack
Ġobject s
ay out
- )
Ġtr ans
S o
Ġf ull
Ġp eople
f ect
Ġbe l
Ġpo inter
ĠHow ever
Ġm in
Ġmethod s
c an
? ?
ĠAn y
g in
Ġanswer s
O M
Wh y
Ġse par
P I
Ġcre ated
Ġcons ider
Ġresult s
Ġsim ilar
T o
Ġf ar
Ġfunction s
Ġpro du
b ox
ad d
Ġall ow
Ġpre tty
Ġneed s
av i
Ġim port
9 9
ou ble
Ġn on
Ġn ull
Ġdu plic
Ġs orry
Ġadd ing
lo c
3 2
Ġerror s
Ġn ames
Ġs ite
l ic
n ew
n er
I D
e f
b ers
Ġincl ude
Ġfig ure
Ġde velo
re am
re en
ic ro
Ġst u
so ft
w ith
w r
Ġwor d
Ġle ar
Ġdec l
Ġpost ed
Ġen c
Ġneed ed
A T
Ġele ments
Ġstate ment
> `
st ring
Ġm ark
d ata
Ġst ruct
Ġc a
Ġf ast
Ġsim ply
ve l
Ġqu ite
ĠP lease
Ġto p
Ġp ri
ac es
Ġchang es
f ace
Ġevery thing
Ġreturn s
en g
our se
r l
Ġdiffer ence
Ġc ert
iv ity
Ġwho le
L E
y stem
i ally
Ġconst ruct
Ġapp ear
Ġthan k
ig h
Ġ1 0
as es
Ġs ide
Ġd iv
Ġas king
Ġinst all
Ġto ol
Ġincl ud
l er
as k
Ġj s
Ġedit ed
2 0
ĠI D
B ut
A r
cl ass
Ġr ow
ĠĠ Ġ
H i
s ed
Ġprov id
Ġwith in
Ġit self
c ed
Ġrem o
ĠWh en
gr ound
th anks
Ġcompil er
ĠJ ust
Ġ &
b ug
Ġt er
Ġatt ribut
Ġfix ed
Ġact ual
od y
O k
Ġre st
nt ax
- >
C l
y s
l ing
m it
() ;
f iddle
ĠI E
ic es
press ion
L L
Ġdes cri
Ġlangu age
icro soft
Ġloc al
Ġstand ard
Ġinit ial
Ġuse ful
Ġin d
ec ess
Ġ` <
ĠU I
Ġin v
Ġinter est
so le
A re
Ġ ro
Ġav oid
Ġc ourse
Ġj Query
Ġf l
Ġbeh avi
Ġper fect
W ell
or s
Ġcomp ile
en sion
Ġsol ve
Ġre f
h aps
Ġimplement ation
Ġquestion s
in ed
ĠS ee
Ġst r
ound s
A n
Ġf ew
D ata
pt y
Ġdes ign
m b
ser t
Ġwant ed
Ġc r
N ame
ĠE x
Ġus es
Ġproblem s
p d
Ġ z
e y
le t
w ise
id th
P lease
lo b
Ġprogram m
Ġbas ed
M y
Ġclass es
im it
ra w
f ort
f e
Ġparamet er
Ġadd ress
w ik
j ava
Ġne xt
Ġmis sing
00 0
Ġd ate
Ġsc reen
ĠP ro
Ġt imes
Ġrec ord
ail able
Ġre d
2 01
Ġcorrect ly
qu e
Ġser vice
Ġf rame
ĠN o
Ġgiv en
Ġb re
Ġdon t
Ġs ign
iz ation
Ġfo lder
ug in
Ġdirect ly
Ġvari ables
b o
yn am
c cess
Ġduplic ate
A s
ap h
Ġbel ieve
b y
Ġs w
Ġsm all
Ġcall ing
Ġsay s
us ed
Ġlin es
Ġd ay
re s
Ġy et
Ġass ign
ic s
ĠA PI
Ġsy ntax
1 4
Ġany way
al se
Ġe qu
Ġag ree
1 6
Ġre ply
S orry
Ġb ug
pl ate
Ġconnect ion
Ġfi l
ĠR e
1 5
Ġus ers
Ġwould n
ĠTh en
th ough
Ġwh ether
Ġn ice
Ġhappen s
v ant
Ġb lock
l ist
eng th
ĠU n
Ġpo s
S QL
Ġmention ed
Ġp ack
Ġcont ext
Ġph p
wh ich
Ġht ml
fort un
ĠU RL
Ġst y
Ġ K
Ġdirect ory
); `
y es
Th ere
Ġp ers
w ard
Ġav ailable
it er
pl es
1 3
t ies
Ġcert ain
Ġw indow
t ext
Ġmat ter
Ġhow ever
Ġperform ance
er n
Ġ Yes
ĠN ot
Ġent ire
A ct
en s
C om
Ġdefin ed
Ġ; )
j ax
o k
Ġc ount
at ically
Ġ !
doc s
an y
Ġl ess
it ch
if ied
as px
Ġeas y
ĠYou r
Ġstu ff
F or
O n
Ġexec ut
Ġst atic
ĠW indows
p ri
Ġeas ier
re d
Ġb ig
Ġsay ing
Ġget s
Ġv ia
Ġt ak
enc es
Ġstruct ure
Ġu rl
Ġb l
N ot
Ġ` .
8 0
Ġme ant
Ġin fo
Ġsome one
ie ld
om ain
Ġs ample
Ġu nt
Ġhand le
ĠS er
Ġaut om
s c
Ġcom e
ub lic
fer ence
Ġj avascript
Ġhelp ful
a z
Ġsugg estion
b it
Y eah
un d
) ?
ĠA pp
ĠA re
C T
Ġin te
Ġdevelo p
Ġr ows
C on
v es
fortun ately
comm end
S h
ir d
ut or
Ġma king
Ġcont roller
1 7
c u
Ġ: -)
Ġsepar ate
Ġcre ating
I d
f ull
Ġp ast
ĠWh y
p s
Ġl ar
o h
m is
re f
Ġcon c
Ġo k
g or
Ġs ession
< /
itt en
Ġre commend
Ġh igh
N ET
Ġ 6
com e
Ġv is
Ġclo se
Ġm ach
; `
. "
l ight
1 9
Ġpart ic
a king
r ror
Ġ 7
Ġa ction
r ow
S cript
it le
if ication
Ġn orm
Ġs it
Ġb ox
ur s
Ġs ave
pt im
ir st
Ġn ecess
Ġem pty
T ext
Ġread ing
Ġ1 00
o ld
Ġsol ved
S er
Ġ >
ed ia
Ġo ld
Ġdocument ation
J ust
Ġle ft
f unction
Ġ #
S E
at tern
Ġim ages
Ġqu ick
Ġst ack
n g
Ġgiv es
Ġpl ay
Ġcon d
2 5
f fer
ec ause
us h
al s
Ġunt il
O bject
Ġtyp es
utor ial
a w
n um
po ssible
am ples
Ġh is
Ġle vel
plo ad
Ġhttp s
i ct
Ġj ava
R E
Ġcom ments
f il
I m
Ġex per
a ction
Ġlear n
Ġt al
ar get
Ġcl ar
V al
S e
Ġc are
ĠX ML
ond er
Ġpartic ular
val id
2 3
ite ly
Ġshould n
Ġsh ows
Ġc ause
li brary
Ġbe low
You r
Ġha ven
a ir
Ġrepl ace
i que
ĠM aybe
D id
val ue
b in
s ite
Ġcond ition
Ġrel ated
Ġf r
js fiddle
( $
and roid
Ġd ynam
Ġcall s
and om
1 8
H ave
t en
as sw
] `
Ġfe ature
Ġit em
ro ss
Ġwas n
Ġo cc
. )
Ġst ep
po se
i ly
) )
o in
Ġp ort
to p
bu gg
Ġwr iting
re ci
Ġch ec
Ġdown load
Ġeff ect
U n
Ġit er
Ġback ground
Ġpl ugin
em ber
Ġre le
Ġpos ition
Ġsp ace
m ost
k en
assw ord
en u
Ġm ist
f ig
de ed
Ġm ind
Ġcharact ers
al c
ĠN ow
Ġcharact er
x ml
Ġex pression
_ _
Ġnum bers
def ined
B y
Ġcon sole
Ġcheck ed
Ġreg ex
2 4
Ġ: (
Ġ es
d n
th at
h er
N S
2 8
rom e
ud io
Ġb ind
Ġadd ition
Ġiss ues
a it
h e
Ġcontain s
Ġfollow ing
ith ub
A lso
Ġproper ly
Ġstring s
Ġdet ails
Ġ 8
Ġattribut e
ag er
Ġgr oup
T P
in dex
Ġs low
et s
U I
Ġc ases
Ġproper ties
Ġask ed
Ġw onder
v ir
d is
v ar
d ate
Ġwr itten
Ġt urn
Ġd ist
Ġde bugg
Ġconstruct or
t est
b ed
Ġhead er
Ġm ove
Ġp ur
u ments
Ġt ables
Ġpre vious
Ġspecif y
p ace
Ġl imit
g n
g ot
m icrosoft
Ġdele te
Ġchang ing
Ġfield s
t ic
Ġm o
Ġlat er
t es
al ity
Ġexpl an
ate ver
ile d
Ġlike ly
Ġh ope
Ġo ptim
Cont roller
ic ient
ab el
ot t
Ġapp reci
Ġgener al
Ġ ..
3 0
li ke
" ?
Ġin sert
b ook
Cl ass
Ġcomplete ly
l ad
c ol
Ġf ail
c le
Ġf in
Ġmach ine
Ġ= =
cu ss
R es
ur ation
A pp
ĠC SS
Ġt ab
it ies
O S
os ed
b ar
ul es
od ing
a ut
re t
h ead
alc ul
c a
Ġun less
Ġthink ing
ĠS O
Ġid ent
Ġbehavi or
un ch
ĠT ry
( ).
re g
Ġre ce
Ġconver t
Ġrequire d
r on
Ġl ayout
2 9
" )
qu est
d it
lob al
m e
Ġp arent
Ġbre ak
ur ing
Ġinter face
Ġprovid ed
Ġparamet ers
p ath
u x
po st
Ġco d
we b
v ices
Ġdefin itely
Ġpr act
Ġpre fer
Ġfe el
de velo
5 0
w ord
r id
Ġse en
Ġcolumn s
2 7
ke y
li b
ot es
Ġaut h
ch ange
t ype
T ype
if ic
full y
Ġperfect ly
u ck
Ġarg ument
Ġexpect ed
2 00
Ġre sol
Ġexpl ic
Ġa ch
Ġst op
A R
Ġde vice
ĠJS ON
3 4
se lect
i pp
A h
plo y
Ġnot e
Ar ray
Ġit ems
Ġ= >
is ion
Ġcle an
mis sion
Ġf ree
m ap
ĠD B
Ġfast er
th ers
Ġstore d
ĠDo es
Ex ception
ari es
ent s
as ed
Ġtak es
Ġpo p
ms dn
ar ray
Ġs av
ĠT o
Ġexplic it
Ġexplan ation
Ġob vious
Ġlog ic
Ġc ell
O T
ur l
ĠA S
f rom
Ġbe gin
Ġsim pl
il t
s u
le x
Ġmod ify
Ġre nder
Ġw ar
Ġsw itch
Ġpoint s
in st
gor ith
our ces
Ġsh ort
ĠS orry
Ġo thers
ur ity
Ġtest ing
Ġs pe
wr ite
ĠP ython
ve ct
Ġe ver
Ġre port
8 6
sol ute
ss ib
Ġtem plate
Ġch ild
Ġfil ter
ut ure
um p
C ol
Ġremo ved
a de
Ġto t
Ġp attern
g oogle
A dd
vir on
se arch
Ġw idth
sp ect
ord ing
F orm
or ks
Ġyour self
Ġtag s
Ġr out
j ust
" >
Ġs ent
ow er
ĠP er
ial og
pre sent
ĠĠĠĠ Ġ
Ġ Y
Ġdefin ition
cl ip
Ġs ch
Ġext ra
i ke
http s
oo ks
Ġinst alled
Ġsome where
st d
Ġb ase
ch eck
[ '
O R
b ody
po int
Ġs ounds
Ġcom es
ĠO S
a iled
Ġautom atically
g ithub
I T
Ġin cre
ĠC ould
0 4
ur ther
Ġpr ot
Ġd ro
Ġsc roll
Ġm on
c o
c at
wik i
Ġassum e
Ġf alse
Ġy ear
Ġfor got
Ġlin ks
ĠS h
Ġcomp ut
' ]
pl it
Ġsty le
d iv
Ġc ou
Ġimport ant
Ġall oc
Ġdef ine
Ġh ost
ĠA ct
Ġcomm on
et imes
Ġma p
Ġp ublic
Ġus ually
le ment
t w
Ġtal king
l ish
5 6
Ġprogramm ing
W ith
O h
Ġshow ing
ĠSt ring
Ġcomple x
ser ver
Ġd ouble
v ote
Ġdepend s
ĠThe y
ou se
' .
Ġhelp ed
Ġwh atever
er o
Ġlar ge
Ġv ar
ĠW e
er ies
enc y
2 6
s ub
Ġc alcul
Ġf uture
or ing
Ġm ode
Ġapp ly
Ġcol lection
Ġde bug
Ġsit u
Ġare n
Ġj ob
clip se
m ed
d b
T ime
Ġnorm al
Ġt rig
Ġext ension
F ile
Ġ our
Ġse ction
Ġout side
s ure
j query
r c
Ġsuggest ed
Ġman ually
Ġt ech
com p
T ry
able d
Ġinterest ing
s cript
Ġreturn ed
et ch
Ġnecess ary
A t
Ġal gorith
Ġgener ated
Ġre present
Ġmy self
Ġt arget
pro du
idd en
on s
Ġhas h
at us
Ġappear s
Ġent er
c orrect
n ter
ch ar
Ġoper ator
Ġex amples
/ )
Ġin deed
Ġoption s
Ġand roid
Ġhelp s
Ġn et
cuss ion
ire d
Ġsu ccess
ĠN S
i ction
Ġro ot
Ġdif f
' )
ord er
p ec
ac le
am ed
M an
o bject
Ġmod ule
Ġx ml
ain t
Ġu pload
T r
Ġse ver
ag ed
Ġ %
E rror
Ġwr ote
oc k
Ġframe work
C ould
viron ment
pp ing
O ST
a le
tern al
Ġreg ist
ĠC om
Ġload ed
N T
ap i
ce l
i ence
Ġal tern
Ġpre sent
Ġd b
l in
b log
d ay
Ġgo es
Ġ )
A l
pr int
Ġacc ount
Ġr andom
Ġtest ed
re sh
Ġmist ake
Ġbu ilt
Ġl ength
Ġd raw
ĠH ave
Ġcr ash
wh y
Ġpack age
Ġs l
Ġreg ard
Ġt im
vect or
Val ue
Ġd el
Ġar tic
Ġpers on
" `
3 3
Ġhe ight
Ġc atch
Ġtr ick
Ġpo ssib
u ri
Ġj query
Ġother wise
Ġthr ow
Ġach ieve
Ġ Q
Do es
Ġs n
Ġloc ation
em pt
S et
Ġw indows
5 4
O f
Ġgener ate
Ġexec ute
Ġa p
Ġp assword
Wh en
Ġd em
Ġchec king
is ed
it es
ay er
l ink
7 7
ĠSer ver
Ġsupp osed
Ġcomp on
D ate
h ost
Ġt ask
at form
Ġc ast
end ed
Ġred irect
O r
ĠJava Script
Ġexist ing
Ġ2 00
Ġper haps
ou b
ch o
Ġb in
Ġthread s
se mb
Ġde al
Ġg ave
ĠD id
Ġsever al
N D
Ġt utorial
Ġrele vant
ĠG oogle
Ġno de
G et
i an
lo at
Ġal most
Ġj oin
t ain
v ate
o pen
r ag
an el
n c
ar ing
D e
at t
an ces
ac ed
Ġ- >
Ġ 9
A M
id es
Ġeas ily
ate g
Ġpre vent
Ġab solute
00 00
doc ument
Ġinclud ed
Ġpass ed
g ate
Ġsc ope
Ġact ivity
Ġversion s
I nt
ĠA l
ac ing
p age
con fig
Ġf urther
ou ch
ĠW ith
re ate
5 9
ĠI m
Ġbas ically
Ġcurrent ly
Ġi gn
Ġpass ing
Ġl uck
Ġanswer ed
ot ed
Ġgiv ing
Ġs ql
Ġb ar
I S
Ġqu eries
b l
Ġaccept ed
Ġt itle
Ġd omain
av ig
Ġwant s
ĠD ata
Ġun ique
Ġany one
ĠA r
D B
end ing
Ġsh are
cl ick
Ġagain st
Ġb ro
U ser
Ġweb site
t able
im al
Ġp ython
an n
Ġa way
el come
Im age
] ;
Ġspec ial
Ġ |
Ġc ache
ĠS e
Ġc ss
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
Ġatt empt
Ġcould n
Ġconf used
br aries
Ġselect ed
ff ect
S ee
Ġwor th
Ġp ages
Ġd ri
et er
ri e
Ġrem ember
ch ron
m ore
8 8
sp ec
Ġg oogle
Ġ2 01
Ġload ing
3 6
Ġword s
Ġstart ed
Ġwar ning
Ġg lobal
O U
m od
ent ly
ĠAnd roid
Ġem ail
yn c
P ath
A X
Ġsetting s
ac ks
Ġsc en
Ġhand ler
Ġprodu ct
Ġa ware
ip edia
It em
ĠA ll
Ġma x
Ġway s
A L
Ġappro pri
ĠL ist
U LL
Ġclar ify
Ġa jax
Ġ âĢ
an ch
Ġappreci ate
Ġbu ffer
LE CT
Ġimplement ed
o ad
Ġarray s
Ġrun s
Ġlink ed
Ġexist s
ĠW eb
Ġsee ing
Ġof ten
Ġen vironment
ab ility
h ere
bo ard
h i
g it
Act ually
Ġd ue
Ġe ar
iction ary
Ġinter n
T able
t ual
Ġin her
d own
Ġlo gg
Ġh our
A d
ĠV iew
Ġby tes
Ġbrows ers
ire ction
5 5
ide o
iz ing
pl ace
Ġpar se
P o
se e
Ġan im
] .
Ġacc ording
Ġtrig ger
Ġwr app
s ize
" ).
g ether
V C
develo per
Ġe cho
Ġcol or
in put
Ġaddition al
Ġst ream
m o
Ġalgorith m
Ġper mission
' ).
Ġevent s
B ox
ic ult
Ġsh own
Ġreturn ing
3 7
Ġdet er
my sql
Ġfunction ality
Ġw ait
Ġlong er
Ġrecord s
Ġpur pose
Ġ` [
Ġad vice
Ġb ott
iv ed
is ual
Ġth ree
im age
re w
ĠA t
Ġsu r
Ġartic le
Ġex cept
Ġim pro
ri end
Ġconfig uration
Ġsub mit
ĠO bject
Ġf ore
Ġarg uments
Ġmy sql
Ġsitu ation
Ġex p
ĠM S
do es
ess age
ent ial
Ġso on
Ġch oo
ap ter
Ġdiff icult
Ġpract ice
Ġrequire s
ĠC ont
e ed
et a
Ġal though
ĠA dd
s l
8 4
Ġon es
ĠMy SQL
8 9
E S
B e
wh en
s v
T F
Ġstart ing
st art
Ġdynam ic
Ġfl ag
ĠC on
In ter
5 7
Ġmess ages
Ġt aking
f l
ĠOn e
Ġse lf
Ġconst ant
Ġsec urity
it ive
Ġlook ed
ib ility
st ood
ach ed
P ar
Ġsom etimes
ent er
Cont ext
Ġli braries
P er
Ġkey s
Ġreg ular
ĠO ther
per ty
M odel
med i
d at
Ġh old
m ar
3 9
Ġunderstand ing
2 2
in ue
de v
ry pt
f ix
Ġt e
Ġm enu
Ġappropri ate
Ġb en
AT E
H T
Ġh it
Ġtest s
Ġlog in
pp ed
Ġp rom
ĠF ire
C ode
ool s
A ll
o ice
Ġrun time
âĢ Ļ
Ġev al
Ġpost ing
O K
o ot
om ething
Ġtr ack
py thon
m p
Ġcertain ly
g u
Ġcomp are
Ġstate ments
on y
Ġtech n
ce ll
Ġaut o
Ġbas ic
h one
y our
Ġo p
x y
am p
C E
W eb
loc al
od es
ĠCh eck
tr ue
* .
Ch eck
in it
g re
Ġin correct
c ss
ĠCh rome
Ġsecond s
f ind
ul ate
Ġret rie
x x
Ġfor get
Ġset up
cl ude
[ ]
se c
Ġjs on
Ġen g
Ġput ting
us ion
Ġthat s
R ead
pos it
all oc
ub y
Ġday s
Ġdoc s
Ġinte ger
Ġad v
Ġrel ation
Ġb ook
Ġcontain er
Ġexplicit ly
ĠB ecause
Ġhappen ing
Ġrefer ences
D K
Ġc orre
Ġser ial
" );
est ed
ell o
ĠU se
1 00
= =
M S
Ġun defined
pro ject
c ount
Ġmis sed
Ġpl atform
f oo
av id
Ġam ount
ri ct
Ġbind ing
n ull
ri es
Ġd ig
: \
I ON
Ġco p
Ġa w
Ġpre ss
so ci
Ġman age
ac cess
Ġtem p
Ġin valid
an e
on ly
ĠG ood
Ġc ook
Ġsupp ose
Ġd oub
ic ate
8 7
Ġdecl ar
Ġr ange
ret urn
ari ly
ir tual
I M
es ome
Ġinclud ing
ri ed
Ġcan t
oh n
ri de
Ġexper ience
ĠHT TP
Ġm om
Ġall ows
Ġstr ange
Ġse qu
Ġscen ari
Ġide as
Ġf inal
Ġign ore
Ġmean ing
Ġeff icient
t ry
ver s
E vent
Ġexecut ed
Ġdet ail
Ġm ar
ter s
ĠD OM
Ġallow ed
Ġd est
Ġpointer s
Ġpoint ing
Ġs k
tr act
iv al
Ġrequest s
a ks
ĠL in
Ġ( `
) :
Ġoper ation
Ġmem ber
ateg ory
Ġtool s
Ġf iddle
Ġenc oding
r un
wik ipedia
us es
Ġapp li
Ġbin ary
Ġqu otes
Ġfigure d
Ġspecif ied
ru ction
cont ent
m ail
Ġres ource
B u
con st
ĠS ince
6 0
Ġ` -
Ġle ave
Ġas semb
ain s
e k
ER E
P U
r ite
Ġto gether
Ġsome how
P l
re n
re m
Ġaltern ative
Ġ` /
S ystem
ĠB y
= '
th read
Ġl a
" :
Ġle ad
Ġcontent s
Ġnet work
Ġdet ect
Ġli b
Ġp ush
Wh ere
un der
ĠH ere
ft ware
Ġn amed
Ġconc ern
ar ant
Ġnot ic
Ġc uri
Ġmom ent
t ag
ĠS ystem
Ġcom ing
Ġter m
ent ially
ĠW ould
ri x
Ġsolution s
Ġsa w
ĠC l
Ġpri vate
Ġsch em
Ġz ero
ĠV S
Ġal ong
ict ure
Ġpast e
Ġbott om
Ġex ternal
ic king
Ġcom plic
or ate
f ield
ck et
Ġl abel
Ġal ert
Ġf ails
4 4
or age
re ference
s ome
pec ially
ast er
Ġfin ish
ut es
G ood
Ġ2 0
Ġdevelop ment
ive ly
Ġinterest ed
s es
ob ile
Ġdis cussion
Ġvalid ation
Ġspe ed
Ġs plit
Ġ \
o ke
Ġd uring
cre ate
t xt
b et
Ġgr aph
Ġcon cept
p ast
Ġre lease
ion s
r is
Ġconf ir
s a
Ġby te
Ġm er
p art
K ey
s on
Ġa ffect
est ing
Ġsn ipp
ver t
Ġse m
Ġd ialog
il i
iv es
Ġi OS
Ġst d
re l
Ġ` (
Ġsupport ed
ĠD on
ut h
j avascript
Ġsh ared
Ġf etch
Ġsugg estions
J S
Ġr ule
Ġre pe
A N
w ell
Ġsend ing
Ġt ree
Se lect
Ġb oo
Ġb ody
Ġh op
ĠI nt
Ġgu ys
mb ol
M aybe
sh ow
D O
Ġwe ird
ĠAny way
In dex
Ġac ross
Ġpre c
Ġwonder ing
ang o
Ġp ick
s orry
th ank
Ġapp s
Ġrel ative
Ġgu arant
js on
Ġdebugg ing
Ġattribut es
Ġview s
m ain
ĠWh ich
Ġcomm un
An y
Ġremo ving
Ġchoo se
ced ure
A B
ure d
ar g
Ġr ules
Ġun fortunately
Ġv ote
Ġyear s
6 6
Ġsu per
Ġmain tain
Ġn ative
Ġclear ly
' `
Ġbehavi our
Ġ3 2
ival ent
Ġf ont
im um
Ġbr anch
Ġas soci
Ġcomput er
Ġspecif ically
v s
en ame
Ġ< /
N ote
Ġcomp ar
Ġw ish
res ult
im g
ĠO pen
Ġlear ning
Ġsa fe
Ġbutton s
L oad
av ing
D ef
ul ator
E lement
id get
Ġin ject
Ġcall back
Ġ 64
le an
oc us
H ERE
Ġnotic ed
Ġm ac
Ġf un
ĠN OT
D on
O P
it em
Ġ vector
Ġdescri ption
h ave
-- --
as p
T W
ic ks
Ġw elcome
Ġf am
Ġmon th
Ġh idden
ĠD e
Ġth ird
j ango
ix el
ign ed
posit ory
Ġtr ouble
4 0
Ġsh ell
N et
Ġ; -)
c all
ers on
ĠP l
) `.
Ġb loc
Ġgr id
Ġregist er
Ġinher it
Ġdisplay ed
d id
ĠO R
s ource
Ġeval u
Ġt ip
Ġtw ice
ĠE ven
Ġconsider ed
ĠW ell
Ġdecl ared
Ġinv ol
Ġc ame
t em
Ġdele ted
Ġmod ified
Ġinst ant
ĠU ser
Ġcon v
Ġde ploy
Ġdynam ically
Ġdecl are
ĠA fter
gr oup
Ġgener ic
S L
Ġinter pre
ĠĠĠĠ ĠĠ
Ġlat est
c ore
H mm
re qu
ĠWh ere
Ġl iter
Ġexec ution
r aph
ĠW ill
? )
() ,
og n
Ġdoub t
3 5
` )
Ġsav ed
On e
Ġcou ple
F rom
Ġqu e
Ġv s
rame work
Ġrequire ment
Ġassum ing
d es
m ine
o v
ĠPer haps
um b
Ġdoes nt
g ed
Ġca using
Th en
Ġag o
Ġb ound
pp er
Ġso ftware
Ġnot ice
con nect
Ġcomplic ated
Ġeff ort
f irst
ĠI P
ĠRe g
bu ild
Ġsu spect
Ġd irection
Ġbeh ind
ple te
a a
Ġconf using
li ent
li er
ward s
ĠO K
pro cess
o ff
Re quest
Ġdepend ing
m ary
Ġ //
ĠSt ack
" ;
Ġrem ote
f ox
Ġv ideo
St ream
Ġres ources
] ,
itt ed
U pd
Ġproject s
ang ed
A D
A P
R OM
Ġch oice
Cont rol
ĠU sing
Ġequ ivalent
Ġnames pace
pp ort
n ess
Ġph one
Ġlangu ages
Ġv irtual
Ġvis ible
ac ke
iz er
ple ase
L og
Ġm ine
Ġg lad
sh ot
m ark
Ġf air
8 5
Ġdebugg er
Ġtot ally
ĠF ile
ĠN ULL
avig ation
Ġext end
ĠAr ray
Ġad min
Ġf riend
Ġreason s
Ġus age
U se
ili ar
pre c
Ġhour s
Ġsy n
ĠIn st
Ġlo ck
Ġoper ations
a f
Ġel ab
Ġtr ace
6 7
Ġf it
But ton
Ġdevelo per
g ress
B ar
acke x
Ġmin utes
ribut e
th ere
Ġre du
Ġim medi
ackex change
Ġ` @
ber n
ĠM VC
Ġtrans action
Ġpl an
Ġtoo k
st y
d f
P ost
de pend
C H
Ġconver sion
e vent
ut able
w orks
Ġpart s
Ġdro p
9 0
Ġ` "
im ple
ĠS E
ar ound
ro du
al f
Ġty po
Ġany where
es e
if ier
ĠE clipse
Act ivity
Ġfe ed
Ġgener ally
Ġes pecially
M ap
s um
Ġsp aces
Ġscenari o
ach ing
ĠV B
f in
Ġcompon ent
g ers
is m
Ġeng ine
Ġch ance
ĠOther wise
led ge
ĠT r
Ġimpro ve
ption s
H e
st ackexchange
Ġconst r
ĠV isual
Ġtrans l
Ser vice
s q
bern ate
Ġref resh
Ġcl ause
y p
ver se
U RL
Ġprocess ing
ĠS ome
c s
Ġpro cedure
ex e
Ġkey word
st er
Ġequ al
Ġj ar
Ġst atus
Ġdescri bed
ĠIt s
Ġcod ing
Man ager
U S
} `
c ast
Ġ Z
Ġinst ances
ff icient
Ġclo sed
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
t tp
c urrent
un k
h and
c ase
Ġabsolute ly
Ġfi re
ace book
V M
Ġh ack
Ġf ill
Ġre produ
E dit
ver flow
Ġp ull
View Controller
Ġcontrol s
man ual
/ #
an c
Ġin ser
m d
ĠID E
ca pe
in ess
ĠAS P
Ġr an
D E
Ġp icture
sh ip
w idth
s ystem
od ed
0 3
Ġent ry
Ġman aged
de le
ĠSt udio
9 7
D F
Ġcom bin
Ġover ride
Ġevery one
H ere
Ġm ouse
e et
() `.
fil es
Ġapplication s
um ber
In st
com pl
am s
Ġw ent
Ġent ity
ri b
Ġauth ent
m atch
Ġu t
l ength
m er
A S
Ġc ross
Ġinte gr
C reate
c lo
Ġf ailed
arent ly
b ase
v let
W e
inst all
Ġdeclar ation
ĠF ROM
m ethod
id ent
Ġf loat
ĠR E
Ġm ix
in fo
Ġan al
Ġy eah
Ġfeature s
Ġbit s
Ġsy mbol
Ġexception s
Ġs light
Ġsimpl er
Ġsnipp et
Ġbegin ning
Ġm ag
Ġhop ing
Ġb us
enc ed
Ġwor ld
Ġth us
Ġar ch
j ar
Ġelab orate
Ġentire ly
Ġlist s
end er
Ġhand ling
Ġc ir
0 7
plic it
Wh ich
ĠH e
ly ing
F ield
re c
O ut
Ġcomp at
ĠT ext
is on
wh ile
Ġobvious ly
p ng
Ġpl ain
Ġpossib ly
ĠG et
Ġter ms
m odel
g ener
4 7
Ġen um
Ġin ner
ĠSt ill
Ġtot al
Ġcre ates
r ic
G reat
Ġear lier
!! !
S c
Ġhead ers
ex ec
r d
\ \
ind ing
e ers
Ġend ed
und le
ug e
p ack
ain ing
sp ond
Ġedit or
Ġfull y
L ayout
Ġconfir m
t u
ĠP ost
Ġben ef
Ġch at
Ġdeter mine
but ton
Ġh im
Ġcop ied
ĠSh ould
et ime
Ġfam iliar
Ġem bed
id ed
Ġne g
n e
F irst
ra ight
k top
Ġfind ing
bet ween
Ġcompile d
Ġsearch ing
Ġ: -
Ġinst ruction
str act
oc ol
Ġg it
Ġl ayer
Ġorig in
add ing
. ,
Ġselect or
l ang
Ġintern al
Ġstart s
oo p
w or
Ġ` #
Ġbl ank
Ġi P
Ġ[ `
? ](
Ġt ouch
Ġstu ck
Ġassemb ly
Cont ent
J AX
c ap
Ġcuri ous
Ġn ested
h a
D oc
cle ar
ĠE dit
m on
P OST
Ġknow n
am b
Ġca pt
Ġli ve
in s
Ġpar sing
Ġscript s
Ġ1 5
st atic
ic ode
Ġwor ry
k now
Ġmatch es
Ġyour s
D avid
Ġc or
] [
Ġdes ired
iv id
ĠW in
a fter
Ġex tract
d omain
Ġst raight
Ġdele gate
or ies
Ġst oring
ĠS et
Ġh int
ill a
ĠG C
Ġdescri be
Ġto ken
Ġm ill
p g
ĠLin ux
Ġpers ist
Ġde v
ver sion
Ġreal ize
Ġany more
Ġsupport s
Ġop in
Ġim ag
compl ish
Ġdid nt
Ġc ap
Ġknow ledge
ĠL et
Ġun it
un c
ĠD ate
Ġinstant i
f alse
SE LECT
Ġrout e
J ava
Ġconstr aint
0 5
ĠB e
Ok ay
d a
up id
St ate
urs or
Ġ Qu
Ġdis c
Ġmis under
Ġcons ist
ĠO f
ĠI M
Ġim possible
ĠE rror
Ġrefer ring
r ows
Ġac complish
enc ies
ĠAct ually
ĠUn fortunately
6 9
e ger
Ġma il
act ly
el per
Ġauth or
Ġbuild ing
Ġare a
' );
dis play
Ġla unch
Ġne ar
Ġen sure
Ġn one
0 9
ĠJ avascript
Cl ick
Ġh ide
Ġd ictionary
ĠIn ter
d k
in es
Ġcorre spond
Ġg ame
Ġ1 2
form at
Ġprodu ction
Ġfor ce
Ġcontain ing
0 2
Ġr id
v as
ĠFire fox
Ġst ay
Ġexp and
n a
S te
r ad
L oc
HT ML
S ource
Ġque ue
an swer
w indow
Ġcom pl
H ey
o om
Ġp ixel
Ġto day
I E
a jax
Ġo dd
Ġcomm it
Ġfin ally
Ġwr ap
ult i
v oid
Ġassign ment
m ake
Ġp ay
Ġma pping
Ġsequ ence
er ic
Ġlot s
ĠF rom
ie ce
ĠL ike
Ġover l
ĠH ope
Ġres p
Ġrest art
re place
cell ent
Ġset s
201 0
Ġter min
ĠN ote
Ġedit ing
v ari
is ing
or acle
ord in
ex ample
t s
Ġof fer
Ġd er
J on
T est
Ġpermission s
App lication
an i
Ġind ivid
Ġrece ive
app lication
Ġs ound
Ġfr ont
Ġa f
Ġ1 6
ator s
Ġunder stood
j av
A C
R I
Ġre search
Ġ$ (
Ġfor ward
i as
L e
Ġco st
aut h
D is
Ġformat ting
u i
y y
chron ous
d ed
ot ing
Ġbro ken
Ġwork around
Ġsub class
? "
Ġimmedi ately
ĠW HERE
a pe
Ġmo ving
Ġcom b
r act
um e
Ġbe com
re quest
Ġint rodu
cre en
Ġknow s
sh ould
ce ed
im ension
Ġdem o
Ġmac ro
Ġcommand s
Ġin line
R un
U T
ĠA JAX
ou nter
il es
Ġretrie ve
m ax
ed u
l en
Ġk new
oth ing
3 8
Ġw a
pl ates
Ġin s
Ġh om
Ġupd ating
Ġlog s
Ġrequire ments
Ġrec ogn
prec ated
Ġp ure
Ġbe come
ro y
com plete
as ks
Ġh uge
Ġ ess
Ġtop ic
an sp
al le
Ġdown vote
0 6
ĠC ode
Ġschem a
Form at
def ault
F F
s ch
b ased
ĠU pd
Ġmem bers
l ash
G rid
m itted
Ġun n
Ġlo ve
Ġman ual
le ep
Ġcheck box
r ation
Ġanim ation
h h
4 9
Ġl ower
m em
a el
ĠW P
Ġclick ed
Ġcod es
Ġco re
ub lish
Ġp iece
is s
. *
as ically
Ġupd ates
om s
ĠU TF
R ow
Ġfr ag
Ġo pp
F A
Ġl ow
ĠC PU
ĠM icrosoft
av en
ĠA ND
c ing
Ġrelation ship
v c
n y
sty le
at er
Ġtrans form
st ems
E N
Ġint ended
E X
ĠS DK
Ġto ld
Ġ$ _
Ġr ound
Ġthere fore
201 2
Ġjs fiddle
v oted
... )
t utorial
Ġind ic
ern el
g ing
z z
Ġre pository
Ġtak en
Ġopin ion
Ġp ot
ag ing
ĠI S
Ġen abled
Ġb log
n s
Ġup gr
Ġco ver
m a
ech an
ĠR ead
Ġnecess arily
num ber
at s
Ġm et
List ener
t im
Ġmat rix
H and
Ġ3 0
> <
z e
Ġn odes
Ġimplement ing
O L
ĠM ac
cl ient
P L
as ure
Ġocc ur
ro p
P r
P E
ĠR es
" ]
Ġi con
Ġb unch
d et
Ġst upid
Res ult
Ġresp ond
ill y
Col lection
ĠS p
h elp
Ġde vices
p atch
u ous
Ġclo sing
m or
Ġsty les
Th read
e v
Ġstr ong
Ġsu it
J ohn
Ġup vote
cl ud
J o
in clude
Ġchec ks
Ġv oid
Ġre set
C lient
Ġ} `
Ġhapp y
w indows
m and
Ġst ated
s ort
* ,
Ġw ont
Ġh alf
Ġf ocus
ĠT H
Ġpri mary
Ġprovid es
ew ork
Ġst orage
p ublic
Ġslight ly
Ġ5 0
Ġcook ie
Ġn or
h o
Ġst ud
im port
Ġexplain ed
ĠP OST
N ow
0 8
Ġcl icking
am ing
Ġman ip
Ġprot ect
nt ity
Ġnorm ally
ĠA m
A ction
Ġh ome
U sing
s y
ad ing
4 5
2 1
ĠOn ly
ra id
Ġsav ing
Ġref lect
Ġu r
Ġappli ed
Ġover load
Ġstep s
po log
Ġh or
i ver
C L
Ġe clipse
Ġpar ser
Ġap i
Ġmatch ing
y ing
y eah
Ġr ot
ony m
/ .
G r
Con nect
C F
Ġdel ay
p ers
Bu ild
Ġr a
W ow
on est
Ġocc urs
Ġresol ve
if est
pon ent
az y
th es
U E
Ġs rc
par se
Ġguess ing
g o
Ġtemp or
li p
Ġde precated
ĠCl ass
Ġco ll
W ould
Ġlimit ed
t d
c pp
ot s
Def ault
Ġca uses
O W
Ġp anel
iz es
A b
At t
ot o
Ġpoint ed
l ayout
Ġexpect ing
Ġpl aces
Ġinclud es
Ġ! =
c al
gram m
G L
um ing
p ass
In fo
f r
it ect
` ](
Ġu nd
Ġprodu ce
g l
IN G
Ġ/ >
Ġwrapp er
Ġbloc ks
Ġregard ing
Ġi ll
Ġacc ur
rem ove
Ġcompar ison
if t
Ġ` \
ĠI IS
ick er
e a
w in
Ġpro xy
Ġser vices
Ġ ^
Ġh ence
(); `
Ġuser name
Ġcont inue
Ġlogg ing
ug ht
Ġbecom es
M ar
Ġad vant
pos ition
Re g
", "
Ġaf raid
j o
R ec
il ities
Ġso cket
Ġrepl aced
Ġm ath
s rc
Ġver t
am er
Ġup on
up date
T im
st ream
Ġm echan
Ġsort ed
Ġvari ous
m eta
M ark
Ġexecut ing
ĠF irst
um s
le vel
l s
pos es
Ġnot ification
Ġread able
Ġlo st
irect ory
ĠF orm
Ġpro file
S u
Ġform s
S how
V ER
Ġsmall er
t itle
Ġle g
Ġc enter
Ġover flow
E D
Ġcompon ents
Ġconv ention
Ġ` '
st ate
Ġgo al
O IN
Ġapp end
R C
Ġre p
Ġres pect
he ight
Ġmo ved
f aces
Ġlar ger
Ġc ar
Ġver ify
us r
Ġresol ved
Ġact ive
Ġpri or
Ġslow er
act ive
: )
Ġor g
Ġfollow ed
Ġ1 1
j or
ĠB Y
Ġre li
ĠI N
set s
Re ference
Ġdepend ency
Ġre load
Ġmark up
s ers
Ġc y
th en
ain er
4 6
st ruct
C ount
Ġsy stems
Ġprom pt
e ach
ĠG UI
s igned
Ġopen ing
Ġpost s
` `
Ġappreci ated
Ġp ower
Ġgu ide
produ ct
ser vice
Ġsur pr
ĠR em
ĠApp le
I I
Ġtyp ed
Ġb o
Ġm obile
Ġprec ise
Ġex port
Ġan not
Ġover head
k it
Ġp ain
id ing
ific ant
p i
Ġanswer ing
Ġim pl
c ent
s m
pos ed
z illa
ist ory
Ġr ad
S ome
Ġbel ong
p arent
v ial
Ġim plicit
Pro perty
le g
Ġo lder
St art
Ġdet ailed
W ill
' )`
Ġexpression s
W indow
in ation
Ġ? ?
R ight
alle l
P re
Ġc ool
as ing
i ag
B ecause
tr ans
Ġscreen shot
Ġunn ecess
pt r
o per
Ġre v
act ory
Ġhappen ed
Un fortunately
Ġprot ocol
Ġloop s
Ġdis able
I K
Ġimag ine
Ġse g
rel ated
P age
Ġpro gress
ou d
Ġknow ing
Ġadd s
d ir
ĠD LL
ak es
X X
li ct
Ġdesign ed
c ould
ex pect
Ġload s
ch at
S ub
r ary
N ice
Ġhigh light
Ġdevelop ers
Ġcou nter
Ġassum ed
ĠM ake
l a
Ġd rag
ul ation
Ġent ries
Ġdec ide
> </
Ġ: /
Ġdepend encies
ain ed
(' #
num er
ĠM an
ĠInst ead
c ond
ĠR uby
Ġch rome
Ġsu bject
onym ous
E n
ot ype
d if
ech o
e ven
Ġg l
ru pt
ĠA d
Ġreprodu ce
Ġserver s
Ġvis ual
Ġincre ment
L ine
Ġaccess ing
Ġp air
Ġconf usion
i od
Ġb ring
u k
Ġread y
par am
: `
in ner
Y ep
ap ache
c ustom
@ "
Ġdisplay ing
i os
ĠĠĠĠĠĠĠĠ Ġ
Ġh ref
H ello
ĠSE LECT
Ġwe ek
Ġtim er
4 8
it ter
ĠS ec
Ġhom ework
Ġi r
Ġcalcul ate
ac y
D ATE
a ul
M essage
Ġmer ge
Ġdis k
) {
m aster
Ġpath s
ar b
n ode
ĠOn ce
st ore
a ff
Ġtext box
a pt
D es
Ġbus iness
h as
Ġm iddle
lin es
Ġok ay
app le
Ġindivid ual
b ecause
art ic
roll ers
ĠAl though
ut il
Ġwa iting
Ġauthent ication
D N
ĠOr acle
ĠS S
Ġprocess es
O C
n ext
N umber
Ġdifferent ly
Ġneg ative
Po int
S ure
B ack
M ethod
on str
T R
D own
p ache
3 1
Ġthr own
Ġinitial ize
ad min
Ġr aw
R em
iv ing
* `
al so
** .
Ġsu m
i um
N ew
s ive
Ġchar m
l ast
Ġ ....
Ġv i
with out
Ġca used
u ff
Ġpre fix
enc ing
Ġl ight
ĠB TW
ĠApp lication
are n
Ġdem onstr
Ġcont in
Ġst ick
?? ?
log y
ing s
Ġmodel s
top ic
ty p
Ġclear er
Ġdri ver
Ġquick ly
ĠA P
Ġf lo
col umn
e el
su pport
6 5
ar p
Ġcont act
Ġ ~
Ġ ed
ĠL og
Ġbr ack
Ġn il
Ġlogg ed
ĠB u
Ġc ut
Ġre write
ch ild
Ġdat es
Ġf ault
Ġsc al
loc ation
Ġrec urs
g i
Ġpo or
Ġhigh er
Ġindex es
Ġtyp ing
IN Q
Ġreal ized
Ġqu ote
W ork
Ġes cape
Ġf oo
pd own
in ct
Ġthr ows
d ll
gr aph
/ ).
es ides
ĠE very
ure s
Ġco ordin
se qu
Ġassign ed
ĠC ol
Ġm s
Ġp a
m et
v m
z ip
Ġfair ly
Ġen able
a im
Ġmar gin
Ġaw esome
Ġconc at
ur al
L ooks
U M
" )`
F I
Ch ar
Ġab stract
Ch anged
Ġsign ature
Ġsign ificant
Ġsuccess fully
Ġma ster
per ties
Ġcondition s
` ).
B ase
fil ter
Ġatt ach
Ġ er
Ġbreak point
ist er
du ct
Ġboo lean
i pe
Ġclient s
[ "
Ġbenef it
b lock
ting s
ĠĠĠĠ ĠĠĠ
oo st
ich ael
j pg
cont inue
Ġad just
Ġne ither
h ome
l ab
Ġele g
re sp
re al
re me
pd f
ang le
se l
g es
dis cussion
re le
A G
Ġse lection
Tr ue
cont roller
Ġd ir
Ġar bit
F rame
7 9
D I
un tu
Ġlist en
Ġopen ed
Ġtime out
Ġarch itect
Ġwh ite
/ `
ro ot
ro oms
est amp
Ġli fe
Ġ1 000
Ġd ll
Ġst ates
= >
R o
it or
Ġl ate
k y
() `,
Ġon line
im ages
and s
ĠV al
b ind
Ġ_ _
Ġpl aced
yn chronous
Ġn avigation
ĠO k
Ġcopy ing
S V
Ġsem ant
AT H
201 1
Ġtell ing
Ġvalid ate
Ġmod ules
ĠE ng
Ġw idget
Ġg one
Ġimplement ations
Ġex it
Ġdec ided
Ġiter ate
e qu
Ġprint ing
S ize
qu are
or er
Ġ` :
j Query
i ant
X ML
Ġpart y
6 8
ial ize
ĠO N
an ced
Ġrender ing
C P
Ġinitial ized
r ails
Ġhard ware
Ġassoci ated
Ġst o
m at
ot er
Ġs ens
av es
dele te
Ġhe ard
ĠR ails
Ġtell s
down load
S ince
Ġc ategory
Ġes cap
Ġdat ab
Ġhelp ing
al k
Ġtr ansp
Ġtem plates
ĠL ook
N ode
T ask
ru by
arch ive
c r
e lement
Ġinter net
Ġcell s
Ġl ack
Ġapp arently
ĠA ccess
ĠIm age
C ell
ust r
ser v
Ġst ri
Ġident ical
ĠWP F
Ġregard less
know n
W indows
Ġ Yeah
Ġw ast
ud o
Ġk ernel
plic ate
Ġunnecess ary
T em
Ġser ious
Ġpur poses
JS ON
In put
Ġoptim ization
m aybe
ar m
Ġclar ification
ĠEx cel
ĠS T
nc y
ĠR ight
Ġg re
A uth
G ET
Ġi e
in i
Ġeleg ant
It s
Ġincre ase
Ġ` {
ard s
Ġdis abled
Ġredu ce
Ġw in
Ġpossib ility
str ap
Ġsc ale
Ġman ager
Ġh onest
b ig
Ġhe ap
Ġb order
Ġre ach
s ession
Ġun able
expect ed
f rame
A fter
Ser ver
Ġsc an
Ġte am
t ion
le ft
Ġp ublish
is ible
t ab
M od
Ġinput s
Ġpart ial
i j
end ar
âĢ Ŀ
d ict
Ġst rict
app ing
ic ial
l ong
be fore
Ġsp ot
pon se
201 3
F iddle
Ġcomp any
sa fe
Ġkey board
Ġun clear
Ġre po
jav ase
form s
Ġiter ation
ĠR un
ann el
art in
co py
ĠSe ems
at abase
Ġconnection s
T H
op s
view s
r ange
Ġma jor
P anel
d ump
Ġind ent
Ġsuggest ing
Ġfo ld
Ġm ig
Ġf lex
Ġt re
ĠiP hone
Ġb atch
M ake
A lex
Ġf our
ul ated
ag raph
P S
Ġconver ted
Ġwhen ever
De le
ĠJ OIN
d on
Ġreason able
Tr ans
im ent
C o
G u
Ġconf lict
cont rol
Ġuse less
de l
Ġint ent
amer a
Ġtempor ary
H ttp
Sh ould
Ġsit es
aut o
) "
el se
a j
ĠT ype
Ġc ursor
Ġconnect ed
S ER
Connect ion
Ġ& &
at tr
ĠA g
ĠA pache
Ġsort ing
.. ...
M at
Ġdownload ed
Ġd ump
ob j
Ġcorrect ed
l ook
By Id
ang es
Ġinstruction s
I C
Ġtri vial
ĠG ET
ĠL INQ
Col or
Ġk ill
Ġact iv
O verflow
Ġif rame
Ġlat ter
er c
col or
Ġb other
Ġ q
Ġlist ed
Ġs ir
ani el
Ġt asks
Doc ument
Ġident ify
Ġturn ed
Ġb tw
/ >
eb in
Ġdis app
n ames
end s
Ġf all
local host
sq li
d ouble
Ġread s
ĠWh ile
u pload
ut s
b re
ra ction
Ġc aching
br ows
oo king
Ġinvol ved
us ers
Ġmost ly
Ġin fin
Ġfore ach
: (
', '
Ġinstall ation
if i
Ġrece ived
p al
Ġprogram s
b ing
Ġcomplex ity
Ġinject ion
Ġrefer enced
ang ing
s omething
Ġhe ar
ĠM ore
angu age
Ġp ool
Ġhand les
Ġrecommend ed
Ġinser ted
Ġadvant age
spec ific
Ġt ick
Ġext reme
O b
Ġp adding
Ġhand led
ag ree
Ġfinish ed
ri st
Ġ: ).
Ġcorrespond ing
G B
7 5
Ġbig ger
Ġdeal ing
Ġmechan ism
Ġess entially
ul a
Ġprovid ing
a q
Ġcert ific
? !
4 2
Ġbug s
Ġseem ed
w esome
c p
c f
Ġgener ating
Ġdeter min
Ġliter al
> >
rib ution
Ġdec imal
pr ot
B l
ĠP DF
z y
Ġd imension
Ġmark ed
ĠS u
Ġcombin ation
W orks
r am
ĠO h
gg le
Ġbre aks
Ġinte gers
R O
Ġpo ly
Ġchild ren
Ġexplain s
Ġembed ded
i est
out put
Ġr ails
Ġgr ab
Ġre ct
ĠTh read
ĠX code
org e
AM E
Ġcomp ared
Ġfrag ment
Ġenc ounter
O pen
Ġper iod
v ider
Ġguarant ee
Ġconver ting
od er
pl ugin
Ġlook up
Ġpop up
Ġt reat
t ml
Ġmag ic
ĠE X
Ġthrow ing
Ġprogramm er
Ġrec ur
Ġa polog
arb age
) `,
ph one
es h
Ġp aren
u c
ynam ic
Ġin depend
amb da
(" #
Ġturn s
ĠM ost
Ġ`$ (
on es
Ġu g
ĠC L
P HP
Ġfeed back
Ġbl ack
Ġarbit rary
Ġmis s
Ġsyn chron
Ġcomm a
Ġin spect
Ġaccording ly
k ill
Ġsome what
Ġprov ider
Ġcre ation
val ues
Ġlin ux
s plit
r b
o ption
le ments
Â ´
it ude
I F
Ġlet s
Ġfil ename
anc y
le ar
ĠP C
Ġkeep ing
Ġorigin ally
Ġl azy
Inter esting
ĠG u
k a
Ġplay er
Ġconcat en
Ġrepl acing
A V
Ġdes ktop
h ash
* )
ht m
ĠSp ring
m ac
Ġconfig ure
t ech
Ġem ulator
s cri
ĠB asically
Ġinherit ance
ĠN et
ĠAct ivity
ac cept
ch a
L ink
Ġent ities
con s
document ation
. `
Ġtal k
ĠCh eers
Ġ= )
numer able
! )
Ad apter
Ġshow ed
c d
Ġpar agraph
Ġ č
Ġloc ally
sp an
Ġal one
Ġrec ent
Ġterm inal
Ġsent ence
ĠA b
m essage
it al
Ġdiffer ences
Ġde ad
ag ue
Ġsm art
Ġcol lect
Ġtab s
act ually
Ġf low
Ġwarning s
Ġst ackoverflow
ix ed
M ain
in y
Ġsu c
w ill
ĠSer vice
l ers
ĠO b
ver age
Ġal ot
om etimes
Ġatt ached
Ġpar allel
ers ion
ĠM odel
at is
Ġc ur
m ulti
ate gor
Ġexecut able
Ġg em
Ġsh ot
ll ing
Ġend s
Ġinv oke
Ġrender ed
he et
ĠW CF
Ġdig its
Ġal ter
Ġsu fficient
Ġcir c
Ġdisplay s
Ġ5 00
Ġcapt ure
Ġsol ves
elp hi
Con fig
on na
Ġs illy
wr iting
p assword
Ġrepresent ation
Ġind icate
Ġcompil ing
Ġas p
iv en
clo se
ĠF F
Ġw atch
200 8
Ex ec
p are
Ġlearn ed
Hand ler
Ġon to
ri ble
Ġresol ution
Ġlist ener
' ;
ĠT able
s ave
Ġexplain ing
T om
past e
Ġman ifest
f loat
Ġr uby
Ġaddress es
os ite
n on
Read er
Ġconfig ured
ĠD is
Ġtrans fer
W r
Ġ201 0
Ġre verse
cre te
pl ot
ier arch
Ġan g
v n
Ġtechn ique
am l
ot al
Ġclean er
s d
Ġdro pdown
wor king
C urrent
E m
or ter
ĠPer l
ĠD I
i brary
Ġre ly
Ġinitial ization
Ġun like
9 5
G ener
Ġme asure
Ġinv est
Par am
Ġcomp ress
Ġsuggest s
Ġcrash es
Ġunder lying
Ġover rid
Ġparen thes
ore d
Ġd iag
Ġst ory
put ation
em ail
H O
Ġtr ust
Ġsc r
Ġout er
7 4
Ġpl us
Ġmax imum
rag ment
Ġcustom er
ruct or
} ,
Ġu l
tag s
Ġappli es
() {
s im
f ramework
Ġalloc ated
l n
) );
Ġf requ
Ġal ph
Ġdiv s
Ġdis agree
Ġre view
Ġ( "
Ġder ived
Ch ris
Ġmanage ment
ĠP o
b b
face book
Ġh over
Ġfl ash
dat abase
g ood
Y I
ĠE ither
Ġ roll
ĠJ VM
9 6
ri an
rele vant
ĠG lad
I G
Ġdraw ing
Ġelse where
( (
ĠE F
Ġf av
Ġ` __
sub mit
Ġcomp aring
Ġ200 8
gramm ing
Ġflo ating
brows er
ĠP re
m enu
com ment
on se
Ġg cc
S p
con f
Ġwhere as
Ġcook ies
u h
Ġmod ification
ĠA ction
Ġaction s
Com mand
back ground
ar r
Ġlet ter
Ġenc rypt
ust er
Ġfail ing
Upd ate
++ .
Ġad apter
Upd ated
in sert
L ook
Ġle ak
cont ext
ĠT est
Ġinter faces
Ġm ut
i bernate
pro perty
C all
B en
Ġas ync
ĠS ub
y ond
ĠM ain
it ed
Ġsec ure
Ġan onymous
Ġdele ting
s creen
Ġrecurs ive
w ing
ut o
ĠâĢ ľ
ar s
Ġtutorial s
] )
Ġsk ip
AB LE
Ġcomment ed
ĠS im
A g
Ġocc urre
im ate
Ġkeep s
7 6
tr ace
L abel
iz ont
b untu
ht access
p ared
Ġconcern ed
orm al
Ġsurpr ised
Ġcommun ity
il ver
are a
ĠB oth
Ġevent ually
N ope
j oin
_ .
Ġhas n
b ie
g s
man y
âĢ ¦
Ġug ly
sel ves
Ġex pen
un defined
log in
Ġcompil ation
Ġcompat ible
e ep
Ġb oot
as ic
Ġmisunder stood
at al
A m
Ġh istory
Ġenter ed
ber t
sp ot
Ġpack ages
Ġlo l
V ery
ist ic
Ġprevious ly
ĠO ut
Ġpast ed
Ġs leep
atis f
Ġupgr ade
ĠTh ese
Ġaccur ate
Ġas ynchronous
P h
Ġc ra
Ġg onna
ant s
Ġfold ers
ites pace
ĠTh ough
Inst ance
P A
al endar
, "
Ġex press
Ġplay ing
G lad
Ġplugin s
d raw
resp onse
ĠL ooks
Ġcare ful
5 8
Ġdatab ases
( [
Ġtri es
user name
' ?
Ġcan vas
Ġextreme ly
The y
\ "
h mm
Ġthem selves
Ġrem ains
im in
9 8
st ack
f ree
ex ist
Ġduplic ates
Ġim p
Ġdat at
I X
Ġsign al
d y
Ġg arbage
S D
Ġf acebook
Ġbro ad
Ġguarant eed
Ġab ility
ĠV ery
ĠS omething
C ustom
ĠAn other
ĠV M
ĠP ar
ĠF acebook
Ġlocal host
ĠN ame
Ġpl ot
M e
Ġref act
Ġh elper
Ġf acing
Ġconsider ing
ew rite
tr l
ĠM any
F ound
Ġs al
Ġsingle ton
in ks
Ġdoc uments
Ġmin imum
5 3
Ġbe yond
gg reg
w o
Ġrest rict
Ġob j
Ġ} );
ĠStack Overflow
ard ing
Ġim ple
Ġan no
Ġarchitect ure
Ġd en
con sole
iter ia
Ġmonth s
is k
e val
il er
> `.
Ġassum ption
ĠEx ception
i us
Ġdest roy
r andom
Ġparam s
ath an
E ven
N ull
ĠE vent
pl us
Ġlog ical
Ġprint ed
A wesome
Ġint ention
Ġoff set
E NT
y a
Ġs quare
ĠUn less
S im
i qu
Ġdes er
Ġsh aring
Ġal ias
mo zilla
5 2
ĠT om
Ġal ign
Ġgener ates
200 9
Ġbrack ets
stand ing
Ġsub st
Ġap ache
t n
7 0
> .
Col umn
Ġb undle
d ated
il ter
Gr oup
Ġanal y
7 8
gre ed
Ġb ash
t a
Ġrecur sion
Ġresult ing
ĠI d
Ġser vlet
Ġc ard
Ġ` _
Ġselect ing
Ġref lection
Ġexper i
Ġth ous
Ġ4 04
ploy ee
Ġrepe at
en e
Ġprint s
12 3
A A
v oke
Ġdisc over
ang er
p th
ĠW orks
ĠQ t
* "
Ġloc ated
Wh ile
++ ,
app end
t ri
Build er
Ġwor se
Ġsh ad
Per haps
F unction
gu ide
Ġr are
S ession
Ch ild
tem plate
Ġinit ially
clud ing
ĠEng lish
Ġob tain
Ġhad n
Ġ` &
ry ption
c ache
( ...
blog s
4 3
Ġ201 2
Ġcl aim
ĠS ure
o lder
ke ll
l at
in c
r an
su per
Ġspecif ication
Ġeas iest
D ialog
d ri
A cc
init ial
Ġcoordin ates
Ġph ys
Ġtyp ically
' :
Ġu pper
ĠC OM
Ġform ula
() )
for ce
f etch
Ġmin ute
Ġt end
E M
vious ly
vari able
Ġfore ign
Ġaccess ible
Ġlog cat
Ġ est
I P
Ġbe an
ri ction
et ers
oc o
t ip
Ġperson ally
It ems
ĠS V
Ġmod ern
C II
Ġboo st
mod ule
ĠN ew
def ine
Ġw ide
1 01
Ġmach ines
head er
Ġ" /
Ġhost ing
Ex t
Ġrem ain
Ġre putation
is es
Ġstop s
Ġdefin ing
le y
sp ring
Ġgroup s
Ġcompil ers
ple x
Ġl ic
Ġmill ion
ategor ies
Ġa head
c atch
z one
Att ribute
develo pers
s ame
r ase
D ER
Ġir relevant
ĠL e
F actory
Ġres ize
N ULL
Ġhope fully
s end
oo ps
t arget
Ġdepend ent
ong o
Ġsitu ations
Ġi p
Ġcertific ate
Ġhard er
u be
arch ar
ĠSec ond
D T
Ġmodify ing
": "
Ġinser ting
Ġcontain ed
Loc ation
iss ues
Ġch art
I L
check ed
---- ----
ok ed
Ġinvest ig
reg ex
est er
sec ond
a i
m ode
Com ponent
Ġinstall ing
enc ode
S ch
U rl
ential s
past ebin
ĠWith out
ĠW ord
Pro cess
Ġany ways
ĠO verflow
Ġinfin ite
Ġs atisf
Val id
fer ences
Ġh ex
Ġn aming
s imple
un g
Ġtw e
Ch ange
Ġexpen sive
Ġcons um
t ree
Ġcont rollers
ĠBu ild
Ġz ip
) ...
ĠSe lect
Ġimple ments
ĠF ramework
ĠH ttp
Ġrele ased
Ġ` `
ys is
Ġinter val
Ġ< <
Ġadv ance
Ġh ierarch
Ġfor um
s ince
Ġrequest ed
ĠT ake
ase t
Ġnum eric
Ġp ip
Ġpixel s
Ġconstraint s
urre ncy
Ġthem e
gr id
ĠD ep
om ic
c or
m aps
Ġt on
Ġy ield
el ess
Ġcompat ibility
Ġassign ing
Ġkind a
Ġcre d
Ġextend s
Ġgreat er
ĠC reate
ty le
v i
Ġsp an
Ġaccept ing
u ed
M ichael
all ow
for ward
Int eger
Ġexper iment
Ġrespon s
Ġfi ref
Ġproduct s
tem p
ĠD elphi
ĠPro ject
Ġred und
Ġtech no
H ash
st atus
Ġhigh ly
ĠG o
Ġ( $
ad ata
M ike
ah a
ĠD ef
Ġdis cuss
ĠS P
Ġfiref ox
o oth
Ġsepar ately
An other
) )`
ic ol
Ġtim estamp
re ed
de cl
l abel
Ġmatter s
Ġpro b
R ob
ri ll
I B
IM E
Ġcl ue
S ec
Ġcr it
Ġdri ve
And roid
Ġim m
F oo
D D
U sers
Ġdec ision
oper ator
Ġde ep
Ġlet ters
e ff
r ound
Ġto mor
/ ?
U p
ul ating
et ter
Ġdist ance
Ġn avig
Ġor ient
ĠP age
P DATE
Ġdirect ories
comm and
Ġgu y
Ġj ump
Ġident ifier
Ġpre sum
oc ation
Ġrec ently
Ġsy nc
ĠP r
D ec
Ġex cellent
ĠM ay
i vers
Ġmin imal
p m
ay s
Ġfail ure
ik i
a u
Ġvi ol
To String
Ġenc oded
mem ory
D et
ĠD es
b lob
Ġs ources
A LL
St ack
Ġv ol
Ġsuit able
by te
Ġp atch
J ames
P ATH
Ġtomor row
ser ve
Ġrefer s
b est
e es
Ġel imin
Ġid s
Ġopp osed
Ġconsist ent
Ġnew er
Ġenum er
Ġd ot
Ġrepe ated
b acks
s k
Ġwh itespace
ĠP DO
eb ug
v otes
R el
it map
ition al
S ql
F T
Ġlink ing
h ello
Ġdocument ed
] :
E L
ĠTr ue
Ġsu mm
ĠP erson
Se ems
Ġupload ed
ĠK ey
ĠM on
pro blem
c ut
Ġaccept able
ex cept
W rite
ĠE ach
R OU
Ġse per
Ġw ww
Ġintern ally
Ġ 80
ĠX SL
ĠAg ain
... "
S ounds
Ġcon crete
c ard
Ġex cel
Ġdist inct
Ġv ague
ac ity
Ġp se
R ect
Ġchar s
9 4
Ġfunction al
Ġiter ator
Ġan ch
Ġsure ly
ĠM ark
im plement
th ink
select ed
Ġcon ven
FA IK
ec lip
h ip
Ġh ook
ĠRE ST
ic ated
at ives
N G
St ill
Ġsp ent
re port
Ġ !!
et y
r al
ilver light
und red
ĠPro bably
Ġsl ash
Ġhand lers
ens ive
Ġspecify ing
I O
ar ning
Ġrece iving
Ġalloc ate
Ġperson al
Pro ject
Ġclo ser
M B
Ġun expected
Ġatt ention
Ġ$ .
af ari
ent ity
Ġa ggreg
A Y
Ġlo se
Ġs amples
Ġstrong ly
FI LE
e fficient
Ġsh eet
de bug
ĠUpd ated
Form s
Ġm edia
Ġinterpre t
Time out
Ġprodu ces
Ġsign ed
Ġpop ulate
D ep
Pro gram
ĠI B
Ġ1 3
ock et
Ġ` %
M ode
am ent
Ġke pt
Ġfact or
se ction
Ġline ar
Ġoperator s
Ġbeh ave
Ġ[ [
C O
Ġrespon ses
Ġrad io
Ġbox es
M M
em ory
Ġ2 4
Ġsub mitted
Ġformat ted
em pty
M on
al though
ĠAct ive
Ġl im
ĠT ime
Ġoption al
u a
ac c
pl orer
P ython
im ation
Ġcl icks
Res ponse
tw o
p ush
os ition
9 2
Ġrest riction
Se arch
em e
Ġcast ing
Ġscroll ing
D aniel
ĠH as
n eed
Table View
sc roll
Ġnice ly
Ġa udio
ĠL ine
ĠD oc
B TW
Ġfact ory
Rec ord
be h
Ġc amera
b a
Tem plate
Ġus ual
ous ly
Ġ" .
ĠA jax
D ictionary
ent y
Ġbloc king
ĠG r
Ġ1 4
ation al
l ive
Ġpro fil
Ġthought s
ck ets
Ġdel imit
Ġrout es
F S
Ġas pect
N AME
ĠI NT
f aq
Ġprogramm ers
wr itten
Res ource
e g
T ake
HT TP
Bu ffer
c ategory
l oop
Ġim g
Ġaccess ed
Ġs izes
ab ling
Ġid i
Ġstructure s
ad ly
() );
po p
ff ice
Ġtag ged
ist r
] +
O ver
comp ile
Add ed
Ġam big
C S
ab out
B r
in ci
($ _
Ġ2 5
ĠUn icode
A SE
e very
Ġsend s
ĠG ener
ow se
Ġoff icial
w p
pl ication
Ġan t
E nd
ĠID s
qu estion
c sv
Ġcompil es
Ġdisapp ear
cri ption
om as
add ress
Ġpot entially
Ġoptim ize
T ag
ĠS y
Ġa verage
Select ed
ribut es
ĠU S
or n
Ġz oom
ep ort
Ġprec ision
M enu
Ġignore d
ab c
Ġextension s
Ġv oted
Ġpri v
] `.
Ġ| |
Ġattempt ing
Ġpot ential
M artin
ĠC ustom
ĠC ons
Ġ" $
Ġe g
Ġc ached
Un it
ok u
ĠIM O
pe g
ĠMS DN
m ath
Ġsch ed
o le
av y
t ools
Ġben ch
= `
U t
f s
Ġdevelop ing
Ġh undred
On ly
ĠURL s
Ġhold s
Or der
Ġread er
Ġdist ribution
it ems
Com p
M att
fo lder
ĠS ol
A PI
ar row
F r
ĠU N
ĠG it
8 3
A ccess
Ġcalcul ation
ak en
Ġunlike ly
Ġedit s
: @"
ĠW ork
A ML
ĠS how
D raw
gg ing
E ntity
Ġsome body
U N
ĠĠĠĠĠĠĠĠ ĠĠ
form ance
f act
sv n
Ġtechn ically
Ġte ach
yp es
Ġre name
` '
Ġp df
P aul
Ġres er
ĠE ntity
ROU P
Ġh um
Ġwhat s
Ġst ru
lo se
b el
ĠN ever
al ert
Ġprefer red
ĠâĢ Ķ
eclip se
app ly
Ġpos itive
n n
Ġth x
Ġautom atic
Ġor d
ĠA cc
r t
"> </
sp ace
Ġn ight
Ġsa f
d jango
ĠS te
(' .
Ġli f
Ġsto pped
arg s
un less
fer ent
g est
: /
if ies
ers core
Ġoutput s
B o
Ġa x
U ID
H ead
Ġt u
99 99
print f
ex ception
Ġcondition al
U L
Ġins ight
Ġtrigger ed
Ġbre aking
Ġcomb ine
Ġar t
Ġthe ory
Ġprot otype
Ġbelong s
Ġver b
Ġalgorith ms
re ally
b ash
Ġwant ing
st ill
Ġindepend ent
en v
Ġsemant ics
Ġsol ving
Per fect
Ġbit map
p aces
Ġas sert
W T
ĠAn swer
Ġoper ating
Ġswitch ing
Ġ* )
Ġmod al
Ġm eta
Ġdefinition s
Ġwr ites
Ġinter act
in ally
Ġd a
l ar
Ġg oog
( {
Ġredund ant
ĠD jango
ĠG rid
M any
Ġport ion
b oost
Ġsim ulator
Ġb acks
m ag
Ġle aving
Pro duct
M P
Ġm ere
i i
Ġfire bug
Ġframe works
f ont
Ġtrick y
Element ById
bu ffer
ast ic
ĠF lash
ann a
r ate
Ġsymbol s
ĠB l
p attern
Ġper l
Ġvis it
Ġopen s
os ity
Ġanno ying
Ġide al
ail ing
p ag
izont al
Ġacc ident
Ġ`$ _
Ġpr ice
stand ard
Ġst udio
Ġmis le
to String
Ġbegin ner
Ġth umb
Re f
ĠN othing
Ġevery where
d ist
ĠC SV
comp at
re h
s est
Ġmention ing
Ġc ent
Ġl ambda
Ġdirect ive
Ġallow ing
v is
ĠAP Is
de c
Dele gate
Ġdown voted
E Y
ĠC all
ĠGC C
ĠQu estion
r s
ĠS afari
iz able
" ...
u id
Ġ" <
i ring
s ign
ĠS ame
Ġsession s
Ġis ol
be ans
is ation
ĠM at
Ġret ain
lic y
Ġma ps
f ire
Ġh ur
ĠI O
st op
sh arp
Ġinstanti ate
typ es
an x
Ġscr atch
o pt
M ax
B inding
ĠP h
al y
ĠS ql
Ġn at
U TF
Ġfl aw
Ġb ul
Ġwrapp ing
Ġma ven
At Index
ĠA LL
Ġrefer encing
Java Script
ĠG reat
ĠT CP
Ġexper t
S omething
ĠArray List
Ġpract ical
n x
Ġsearch ed
word press
blog spot
iz ations
pri vate
Ġadv ise
Ġparticular ly
act er
C CE
Ġcol ors
ĠCont ent
Pro vider
n il
ĠS SL
Ġhand y
Ġd ict
P eter
F C
Ġmult ip
M A
Ġfix es
Ġr ate
bo ot
Ġpattern s
Ġcare fully
Ġcop ies
.... ....
y e
Ġser ies
Ġloop ing
Ġcr iteria
** ,
t mp
Ġpro f
pri se
in ary
ĠThere fore
= $
Ġd jango
ĠCom p
Ġtrig gers
Ġg reen
Ġeffect ively
Ġ* **
SS ION
Ġh y
ĠSt art
Ġ 00
Ġexpect s
function s
Ġtrans ition
Ġtransp arent
In deed
Ġclo sure
one y
Ġinv oked
Does n
ant ed
s ites
g en
Ġst age
inst ance
ĠDate Time
Ġfix ing
ĠUpd ate
i ate
g cc
Ġgener ator
h ide
E d
, ,
Ġanal ysis
ĠM ap
Ġopp osite
Ġt ill
h ref
Ġtr a
h ar
el ine
Ġf ace
: "
cont ainer
Ġfil led
Ġalloc ation
Ex actly
Ġcomp reh
ĠA h
Ġnot ation
Ġsimpl ify
8 2
Ġsubst it
multi ple
Ġed ge
Ġqu al
ĠâĢ ĵ
eng ine
Ġcl one
artic les
N O
Ġeffect s
und ament
" );`
Ġexecut es
c ce
ĠXSL T
ex pression
ative ly
Ġmin or
h idden
u zz
F ilter
Ġlabel s
Ġch annel
Ġsimpl est
Ġhierarch y
l anguage
em a
f orge
Ġlead ing
6 3
9 3
um my
ĠC ore
Ġsh all
size of
N e
Ġc md
Ġro b
Ġfeel ing
Ġprocess or
Ġcirc um
ĠM e
Ġprotect ed
m ove
L in
Ġm ate
Ġpar sed
Ġdat aset
n ers
Ġstore s
Ġpri mit
velo per
ĠB ack
m f
5 1
Ġannot ation
R ange
C ool
lin ux
... `
Ġser ve
] ;`
az ing
per l
am n
Ġwh ose
ĠT im
ĠE n
Ġis nt
Ġsp ring
requ ire
Ġcra zy
H tml
ĠIs n
Ġback up
Ġsh orter
re nder
7 3
Ġfi red
ĠA ss
c ial
m ay
ĠS c
ĠH ash
Ġorg an
S tyle
Ġindic ates
Ġreplace ment
os en
DB C
K it
ĠN ice
Ġtransl ate
()` ?
Ġch ain
m t
" *
m vc
Ġdecl aring
Ġcomple ted
Ġplatform s
Ġqu ality
sc ope
ook ie
Ġun signed
Ġreport s
Ġcl uster
And rew
Mar c
oo lean
Ġorder ing
ic i
Ġnot ed
Ġevalu ate
ĠPro blem
Ġwrapp ed
ĠAS CII
Ġover kill
A ss
Add ress
en k
Ġcan cel
Ġprogramm atically
sh ared
ĠC o
Ser ial
Ġapp lic
f ill
po inter
Ġreli able
P erson
Ġdes cript
7 2
Ġp i
ue ue
In it
ateg y
ĠM ar
Ġw ild
es cape
Ġwast e
Ġach ie
ĠCons ider
Ġg ithub
if f
} "
Ġad apt
the y
> ,
E B
d ynamic
Ġsp end
C ON
ĠR AM
Ġregister ed
Ġlevel s
w ould
oco a
leg al
Ġfo ll
Ġcommun ication
Ġpr inci
li es
r ough
Ġst at
Ġcred entials
Ġro le
Ġear ly
or ig
cl usion
Ġaw k
un it
r out
T ried
class es
Sc roll
Out put
t ool
ĠS ometimes
ĠE xt
Ġclass path
sing le
Ġrecogn ize
Object s
St atus
ĠS ource
get ElementById
ĠE D
ĠSQL ite
u ly
object s
od b
Ġen code
F l
Ġd anger
)` ?
... ?
1 10
Y up
Ġsub scri
Ġsepar ated
p a
T ab
Ã ©
Ġ< =
rows er
Ġpre d
g lobal
O B
Ġsc ore
pect ive
c er
č Ġč
app s
O per
Pl ayer
semb ly
oub les
ĠL ink
ĠIM HO
Ġprecise ly
Ġ* "
Ġre use
Ġper cent
c cept
cl es
Ġjoin s
ĠRe ally
us ive
Ġmisle ading
E E
Ġh ate
Ġpl enty
p ages
ount y
ĠJ on
T O
Ex cellent
Ġprocess ed
Ġon click
fore ach
Ġsuc ceed
L D
# .
? `
m edia
Ġnear ly
Ġinv o
aut if
col lection
** *
G ot
ĠOpen GL
ep ad
Ġimp act
Ġflag s
ĠS ession
T E
sec urity
as y
s n
Ġconstruct ors
5 00
ĠX P
ipp ed
j sp
pro gram
Ġwe ight
Ġenc ryption
Ġoverrid ing
R A
N ever
all ery
Ġun related
al ways
b ad
rill iant
Ġman ner
L et
ĠS imple
Is n
L ength
Q UE
h igh
ho lder
Ġ> =
Ġatt ack
load ing
end or
ent ication
Ġdis patch
Ġas ks
con vert
Ġread ability
Ġseg ment
n ce
Ġde pth
Ġgre p
H A
ĠTh ose
Ġdesign er
Ġcuri osity
Ġre n
Date Time
Ġg lob
6 2
C ore
an other
us hing
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
Ġ$ ('#
Ġfilter ing
az on
d rop
ise cond
; "
Ġh er
Ġback end
Ġnum er
ut f
ĠC urrent
S m
pack age
OU NT
Y Y
!! !!
connect ion
Ġwor st
Ġ{ }
un ity
ect or
x sl
h ey
Ġfav or
we ight
Ġj o
Ġ201 3
S ame
ĠB ase
z er
f ault
al a
il s
gg ling
U R
Ġap art
Ġ' /
add ed
read ing
Ġcall er
ar on
z a
Ġequ als
Ġ( )
OM E
